---
kind: type
id: T:Autodesk.Revit.DB.Electrical.CircuitType
source: html/58f65579-ed78-e37e-ad41-983a516afa22.htm
---
# Autodesk.Revit.DB.Electrical.CircuitType

An enumerated type listing all the possible circuit types.

## Syntax (C#)
```csharp
public enum CircuitType
```